x = 38
print('Дратути!')
if x < 0:
    print('Меньше нуля')
print('дотвидания')
print('----------------------------')
a, b = 10, 5
if a > b:
    print('a > b')
if a > b and a > 0:
    print('успех')
if (a > b) and (a > 0 or b < 1000):
    print('успех')
if 5 < b and b < 10:
    print('успех')
print('---------------------------')
if '34' > '123': # можно сравнивать - числа, строки, списки, разное
    print('Успех')
if '123' > '12':
    print('Успех')
if [1, 2] > [1, 1]:
    print('Успех')
print('----------------------------')
if '6' > 5:     # нельзя сравнивать разные типы данных
    print('Успех')
if [5, 6] > 5:     # нельзя сравнивать разные типы данных
    print('Успех')
if '6' != 5:     # Если неравенство то можно
    print('Успех')
